perf/results/mem/read_100rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 5723.624ms, rate sampling interval: 18497ms
  Thread calibration: mean lat.: 5353.344ms, rate sampling interval: 17268ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.20s     5.45s   28.26s    57.98%
    Req/Sec     2.50      0.50     3.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.20s 
 75.000%   23.92s 
 90.000%   26.57s 
 99.000%   28.11s 
 99.900%   28.28s 
 99.990%   28.28s 
 99.999%   28.28s 
100.000%   28.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9682.943     0.000000            1         1.00
   11427.839     0.100000           12         1.11
   13615.103     0.200000           24         1.25
   15515.647     0.300000           36         1.43
   17465.343     0.400000           48         1.67
   19202.047     0.500000           60         2.00
   20135.935     0.550000           66         2.22
   21086.207     0.600000           72         2.50
   22134.783     0.650000           78         2.86
   23117.823     0.700000           84         3.33
   24084.479     0.750000           90         4.00
   24526.847     0.775000           93         4.44
   24969.215     0.800000           96         5.00
   25296.895     0.825000           99         5.71
   25804.799     0.850000          102         6.67
   26263.551     0.875000          105         8.00
   26427.391     0.887500          106         8.89
   26738.687     0.900000          108        10.00
   26902.527     0.912500          109        11.43
   27213.823     0.925000          111        13.33
   27312.127     0.937500          112        16.00
   27475.967     0.943750          113        17.78
   27639.807     0.950000          114        20.00
   27639.807     0.956250          114        22.86
   27803.647     0.962500          115        26.67
   27951.103     0.968750          116        32.00
   27951.103     0.971875          116        35.56
   27967.487     0.975000          117        40.00
   27967.487     0.978125          117        45.71
   27967.487     0.981250          117        53.33
   28114.943     0.984375          118        64.00
   28114.943     0.985938          118        71.11
   28114.943     0.987500          118        80.00
   28114.943     0.989062          118        91.43
   28114.943     0.990625          118       106.67
   28278.783     0.992188          119       128.00
   28278.783     1.000000          119          inf
#[Mean    =    19198.159, StdDeviation   =     5445.075]
#[Max     =    28262.400, Total count    =          119]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  161 requests in 30.07s, 7.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 156
Requests/sec:      5.35
Transfer/sec:    238.75KB