perf/results/mem/read_50rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 5538.334ms, rate sampling interval: 17760ms
  Thread calibration: mean lat.: 5393.842ms, rate sampling interval: 16465ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.87s     4.97s   26.64s    59.48%
    Req/Sec     2.00      0.00     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.81s 
 75.000%   21.89s 
 90.000%   24.71s 
 99.000%   26.44s 
 99.900%   26.66s 
 99.990%   26.66s 
 99.999%   26.66s 
100.000%   26.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9330.687     0.000000            1         1.00
   10944.511     0.100000           12         1.11
   12910.591     0.200000           24         1.25
   14352.383     0.300000           35         1.43
   16195.583     0.400000           47         1.67
   17809.407     0.500000           58         2.00
   18825.215     0.550000           64         2.22
   19496.959     0.600000           70         2.50
   20365.311     0.650000           76         2.86
   21315.583     0.700000           82         3.33
   21889.023     0.750000           87         4.00
   22396.927     0.775000           90         4.44
   22888.447     0.800000           93         5.00
   23248.895     0.825000           96         5.71
   23904.255     0.850000           99         6.67
   24444.927     0.875000          102         8.00
   24543.231     0.887500          103         8.89
   24739.839     0.900000          105        10.00
   24985.599     0.912500          106        11.43
   25395.199     0.925000          108        13.33
   25591.807     0.937500          109        16.00
   25804.799     0.943750          110        17.78
   25985.023     0.950000          111        20.00
   25985.023     0.956250          111        22.86
   26116.095     0.962500          112        26.67
   26148.863     0.968750          113        32.00
   26148.863     0.971875          113        35.56
   26329.087     0.975000          114        40.00
   26329.087     0.978125          114        45.71
   26329.087     0.981250          114        53.33
   26443.775     0.984375          115        64.00
   26443.775     0.985938          115        71.11
   26443.775     0.987500          115        80.00
   26443.775     0.989062          115        91.43
   26443.775     0.990625          115       106.67
   26656.767     0.992188          116       128.00
   26656.767     1.000000          116          inf
#[Mean    =    17867.635, StdDeviation   =     4970.641]
#[Max     =    26640.384, Total count    =          116]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  164 requests in 30.07s, 7.14MB read
  Socket errors: connect 0, read 0, write 0, timeout 153
Requests/sec:      5.45
Transfer/sec:    243.17KB